STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.h
/* CAP Linkup State */
typedef uint8_t APP_CAP_Linkup_State_t;
#define APP_CAP_LINKUP_STATE_NONE               0x00
#define APP_CAP_LINKUP_STATE_STARTED_RESTORE    0x01
#define APP_CAP_LINKUP_STATE_STARTED_COMPLETE   0x02
#define APP_CAP_LINKUP_STATE_DONE_RESTORE       0x03
#define APP_CAP_LINKUP_STATE_DONE_COMPLETE      0x04

typedef uint8_t APP_PASyncState_t;
#define APP_PA_SYNC_STATE_IDLE           (0x00)
#define APP_PA_SYNC_STATE_SYNCHRONIZING  (0x01)
#define APP_PA_SYNC_STATE_SYNCHRONIZED   (0x02)

typedef uint8_t APP_BIGSyncState_t;
#define APP_BIG_SYNC_STATE_IDLE          (0x00)
#define APP_BIG_SYNC_STATE_SYNCHRONIZING (0x01)
#define APP_BIG_SYNC_STATE_SYNCHRONIZED  (0x02)

typedef uint8_t APP_ScanState_t;
#define APP_SCAN_STATE_IDLE              (0x00)
#define APP_SCAN_STATE_SCANNING          (0x01)

typedef uint8_t APP_BroadcastMode_t;
#define APP_BROADCAST_MODE_NONE                                 (0x00)
#define APP_BROADCAST_MODE_SINK_ONLY                            (0x01)
#define APP_BROADCAST_MODE_SCAN_DELEGATOR                       (0x02)

/*Structure used for ASE information storage*/
typedef struct
{
  uint8_t               ID;
  ASE_State_t           state;
  ASE_Type_t            type;           /*Source of Sink*/
  uint8_t               allocated;
  uint8_t               num_channels;
  uint32_t              presentation_delay;
  uint32_t              controller_delay;
  Audio_Context_t       streaming_audio_context;
  uint8_t               enable_req;
}APP_ASE_Info_t;

typedef struct
{
  uint16_t              acl_conn_handle;
#if (APP_NUM_SNK_ASE > 0)
  APP_ASE_Info_t        aSnkASE[APP_NUM_SNK_ASE];
#endif /* (APP_NUM_SNK_ASE > 0) */
#if (APP_NUM_SRC_ASE > 0)
  APP_ASE_Info_t        aSrcASE[APP_NUM_SRC_ASE];
#endif /* (APP_NUM_SRC_ASE > 0) */
}APP_ASEs_t;

/*Structure used for connection information strorage*/
typedef struct
{
  uint16_t               Acl_Conn_Handle;
  uint8_t                Peer_Address_Type;
  uint8_t                Peer_Address[6];
  uint8_t                Role;
  audio_profile_t        AudioProfile;
  uint8_t                ConfirmIndicationRequired;
  APP_ASEs_t             *pASEs;
  Audio_Context_t        AvailableSnkAudioContext;
  Audio_Context_t        AvailableSrcAudioContext;
}APP_ACL_Conn_t;

#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)
typedef struct
{
  BAP_BASE_Group_t              base_group;
  BAP_BASE_Subgroup_t           base_subgroups[2];
  BAP_BASE_BIS_t                base_bis[2];
  uint8_t                       codec_specific_config_bis[2][MAX_BSNK_BIS_CODEC_CONFIG_SIZE];
  uint8_t                       codec_specific_config_subgroup[2][MAX_BSNK_SUBGROUP_CODEC_CONFIG_SIZE];
  uint8_t                       RTN;
  uint16_t                      max_transport_latency;
  uint8_t                       subgroup_metadata[2][MAX_BSNK_METADATA_LEN];
  Target_Phy_t                  phy;
  uint8_t                       encryption;
  uint32_t                      broadcast_code[4u];
  uint8_t                       audio_driver_config;
  uint16_t                      current_BIS_conn_handles[APP_MAX_NUM_BIS];
  uint8_t                       current_num_bis;
  BAP_AudioCodecController_t    AudioCodecInController;
  BAP_SupportedStandardCodec_t  aStandardCodec[1];
  APP_PASyncState_t             PASyncState;
  APP_BIGSyncState_t            BIGSyncState;
  APP_ScanState_t               ScanState;
  uint8_t                       PASyncHandle;
  Audio_Location_t              Audio_Location;
  uint8_t                       sync_bis_index[APP_MAX_NUM_BIS];
  uint8_t                       num_sync_bis;
} APP_BNSK_Context_t;
#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/

typedef struct
{
  BAP_Role_t                    bap_role;

  APP_ACL_Conn_t                ACL_Conn[CFG_BLE_NUM_LINK];

  uint8_t                       NumConn;

  uint8_t                       audio_driver_config;

  Audio_Role_t                  audio_role_setup;

  uint16_t                      cis_src_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_src;

  uint16_t                      cis_snk_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_snk;

  uint16_t                      cis_handle[APP_MAX_NUM_CIS];

  uint8_t                       num_cis_established;

  BAP_AudioCodecController_t    AudioCodecInController;

  BAP_SupportedStandardCodec_t  aStandardCodec[1];

  uint8_t                       NumSnkASEs;

  uint8_t                       NumSrcASEs;

  APP_ASEs_t                    aASEs[CFG_BLE_NUM_LINK];

  Audio_Location_t              SnkAudioLocations;

  Audio_Location_t              SrcAudioLocations;

  Audio_Context_t               SupportedSnkAudioContext;

  Audio_Context_t               SupportedSrcAudioContext;

  Audio_Context_t               AvailableSnkAudioContext;

  Audio_Context_t               AvailableSrcAudioContext;

  /* Codec Specific Capabilities for Sink Record */
#if (APP_NUM_SNK_PAC_RECORDS > 0)

  /* Handle of the Sink Audio Codec Record*/
  uint16_t                      aSnkPACRecordHandle[APP_NUM_SNK_PAC_RECORDS];

  /* Sink Published Audio Capabilities Records slots */
  BAP_AudioPACRecord_t          aSnkPACRecord[APP_NUM_SNK_PAC_RECORDS];

  /* Codec Specific Capabilities */
  uint8_t                       aSnkCap[APP_NUM_SNK_PAC_RECORDS][PACS_CODEC_SPECIFIC_CAPABILITIES_LENGTH];

  /* Metadata*/
  uint8_t                       aSnkMetadata[APP_NUM_SNK_PAC_RECORDS][PACS_SRV_METADATA_SIZE];

#endif /*(APP_NUM_SNK_PAC_RECORDS > 0)*/
  /*Codec Specific Capabilities for Source Record*/
#if (APP_NUM_SRC_PAC_RECORDS > 0)

  /*Handle of the Source PAC Record*/
  uint16_t                      aSrcPACRecordHandle[APP_NUM_SRC_PAC_RECORDS];

  /* Source Published Audio Capabilities Records slots*/
  BAP_AudioPACRecord_t          aSrcPACRecord[APP_NUM_SRC_PAC_RECORDS];

  /* Codec Specific Capabilities */
  uint8_t                       aSrcCap[APP_NUM_SRC_PAC_RECORDS][PACS_CODEC_SPECIFIC_CAPABILITIES_LENGTH];

