STMicroelectronics/STM32CubeWBA/Projects/STM32WBA65I-DK1/Applications/BLE/BLE_Audio_GMAP_Peripheral/STM32_WPAN/App/gmap_app.h
  /* Metadata*/
  uint8_t                       aSrcMetadata[APP_NUM_SRC_PAC_RECORDS][PACS_SRV_METADATA_SIZE];

#endif /*(APP_NUM_SRC_PAC_RECORDS > 0)*/

  uint8_t                       NumOutputChannels;

#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT)
  uint8_t                       CSIPRank;
#endif /* (APP_CSIP_ROLE_SET_MEMBER_SUPPORT) */

  Sampling_Freq_t               ConfiguredSinkSampleFrequency;
  Sampling_Freq_t               ConfiguredSourceSampleFrequency;
#if ((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)
  APP_BNSK_Context_t            BSNK;
#endif /*((APP_GMAP_ROLE & GMAP_ROLE_BROADCAST_GAME_RECEIVER) == GMAP_ROLE_BROADCAST_GAME_RECEIVER)*/

  APP_BroadcastMode_t           BroadcastMode;

  uint8_t                       SinkDecimation;
  uint8_t                       SourceDecimation;
} GMAPAPP_Context_t;

typedef struct
{
  Supported_Sampling_Freq_t     Freq;
  Supported_Frame_Duration_t    FrameDuration;
  uint16_t                      MinOctetsPerCodecFrame;
  uint16_t                      MaxOctetsPerCodecFrame;

} APP_CodecCap_t;

typedef struct
{
  Sampling_Freq_t       freq;
  uint32_t              sdu_interval;
  BAP_Framing_t         framing;
  uint16_t              max_sdu;
  uint8_t               rtx_num;
  uint16_t              max_tp_latency;
  uint32_t              presentation_delay;

} APP_QoSConf_t;

typedef struct
{
  uint8_t       NumSnkASEs;
  uint8_t       NumSrcASEs;
  uint8_t       NumAudioChnlsPerSnkASE;
  uint8_t       MinSnkAudioLocations;
  uint8_t       NumAudioChnlsPerSrcASE;
  uint8_t       MinSrcAudioLocations;
  uint8_t       NumCISes;
  uint16_t      NumAudioStreams;

} APP_UnicastAudioConf_t;


/* External variables --------------------------------------------------------*/

/* Exported macros ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions ---------------------------------------------*/
tBleStatus APP_AUDIO_STACK_Init(void);
void GMAPAPP_Init(uint8_t csip_config_id);
tBleStatus GMAPAPP_Linkup(uint16_t ConnHandle);
uint8_t GMAPAPP_StartAdvertising(CAP_Announcement_t AnnouncementType,uint8_t EnableSolicitationRequest,
                                 uint16_t Appearance);
uint8_t GMAPAPP_StopAdvertising(void);
uint8_t GMAPAPP_VolumeUp(void);
uint8_t GMAPAPP_VolumeDown(void);
uint8_t GMAPAPP_ToggleMute(void);
uint8_t GMAPAPP_ToggleMicrophoneMute(void);
uint8_t GMAPAPP_Disconnect(void);
void GMAPAPP_AclConnected(uint16_t Conn_Handle,uint8_t Peer_Address_Type,uint8_t Peer_Address[6],uint8_t role);
void GMAPAPP_CISConnected(uint16_t Conn_Handle);
void GMAPAPP_LinkDisconnected(uint16_t Conn_Handle,uint8_t Reason);
void GMAPAPP_ConfirmIndicationRequired(uint16_t Conn_Handle);
void GMAPAPP_BondLost(uint16_t Conn_Handle);
#if (APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u)
tBleStatus CSIPAPP_RegisterCSIS(uint8_t instance_id,
                                uint8_t SIRK_OOB,
                                uint8_t SIRK_type,
                                uint8_t* SIRK,
                                uint8_t size,
                                uint8_t rank);
#endif /*APP_CSIP_ROLE_SET_MEMBER_SUPPORT == 1u)*/
uint8_t GMAPAPP_SyncToPA(uint8_t AdvSID, uint8_t *pAdvAddress, uint8_t AdvAddressType);
uint8_t GMAPAPP_StartSink(void);
uint8_t GMAPAPP_StopSink(void);
void GMAPAPP_SetBroadcastMode(APP_BroadcastMode_t mode);
void GMAPAPP_ClearDatabase(void);
#ifdef __cplusplus
}
#endif

#endif /*__GMAP_APP_H */
